Revit 2026 API

# RebarPropagation Methods

---

The RebarPropagation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignByFace |  |
|  | AlignByHost |  |

#### Reference

RebarPropagation Class

Autodesk.Revit.DB.Structure Namespace